/*
package com.nuist.exc;

public class Test {
}
*/

/*
* 1.在课堂练习的基础上,统计指定目录下的所有子文件和子目录 找到
最大文件和最小文件对应的文件路径和字节大小

2.在目录下生成100个具有随机名字的文件 名字范围为a-z (两位文件名 没有后缀名)
找到所有 c开头的文件 删除他们 找到所有d开头的文件 记录文件名和文件的数量

3.输入一个文件路径 删除该文件(如果是目录 要求能够删除这个目录下的所有子文件和子目录)
需要注意的是 File类的delete方法是无法直接删除非空目录的

4.文件复制 要求支持复制目录 复制的时候要复制目录和所有子文件和子目录下的文件
拆开做 先做文件(非文本)复制
public static void copyFile(File sourceFile,File pasteFile){}
5.实现批量下载 将下载链接存储至文本中 可以下载文本中记录的所有url(用缓存流做)
6.拓展(孙宁泽 孔正涛必做) 实现文件搜索功能 可以根据文件的大小或者包含名称进行搜索
(在java中创建合适的数据结构来作为文件的索引 可以考虑做索引持久化)
将搜索记录和搜索结果存入到 search.log文本中
并且支持搜索之后是否删除功能？

7.力扣 5题

8.java 牛客网50题
* */
